CommonSecurityLog
| where DeviceVendor == "VOTIRO" and DeviceProduct == "Votiro Cloud"
| parse-kv AdditionalExtensions as (companyName: string, correlationId:guid, itemId: guid, fname: string, fsize: int, passwordProtected: bool, avResult: string, threatCount: int, blockedCount: int, fileModification: string, sanitizationResult: string, sanitizationTime: int, connectorType: string, connectorName: string, connectorId: dynamic, policyName: string, exceptionId: dynamic, incidentURL: dynamic, messageId: dynamic, subject: string, from: string, recipients: string) with (pair_delimiter=";", kv_delimiter="=")
| project-rename
    SrcFileSHA256=FileHash
| project-away AdditionalExtensions